hornetq-reference-binding/src/test/resources/xml/soap-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <greeting:greet xmlns:greeting="urn:switchyard-quickstart:hornetq-reference-binding:1.0">
            <name>Tomo</name>
        </greeting:greet>
    </soap:Body>
</soap:Envelope>
